wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    /*
     * 左右分隔线。
     */
    BSP_LCD_SetTextColor(LCD_COLOR_GRAY);

    BSP_LCD_DrawVLine(
        APP_SEPARATOR_X,
        5U,
        BSP_LCD_GetYSize() - 10U
    );

    APP_DrawLeftPanel();
    APP_DrawAllMilkButtons();
}

static void APP_DrawLeftPanel(void)
{
    char text[40];
    uint8_t i;

    /*
     * 清除整个左侧区域。
     */
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    BSP_LCD_FillRect(
        0U,
        0U,
        APP_SEPARATOR_X - 2U,
        BSP_LCD_GetYSize()
    );

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    snprintf(
        text,
        sizeof(text),
        "Date: %04u-%02u-%02u",
        appTodayYear,
        appTodayMonth,
        appTodayDay
    );

    BSP_LCD_DisplayStringAt(
        APP_RECORD_X,
        8U,
        (uint8_t *)text,
        LEFT_MODE
    );

    snprintf(
        text,
        sizeof(text),
        "Total: %lu ml",
        (unsigned long)appTodayTotalMl
    );

    BSP_LCD_DisplayStringAt(
        APP_RECORD_X,
        32U,
        (uint8_t *)text,
        LEFT_MODE
    );

    BSP_LCD_DisplayStringAt(
        APP_RECORD_X,
        55U,
        (uint8_t *)"Time        Amount",
        LEFT_MODE
    );

    for (i = 0U; i < appRecordCount; i++)
    {
        snprintf(
            text,
            sizeof(text),
            "%02u:%02u:%02u   %3u ml",
            appMilkRecords[i].hour,
            appMilkRecords[i].minute,
            appMilkRecords[i].second,
            appMilkRecords[i].amountMl
        );

        BSP_LCD_DisplayStringAt(
            APP_RECORD_X,
            APP_RECORD_Y +
                ((uint16_t)i *
                 APP_RECORD_LINE_HEIGHT),
            (uint8_t *)text,
            LEFT_MODE
        );
    }
}

static void APP_DrawMilkButton(
    uint8_t buttonIndex,
    uint8_t pressed)
{
    const APP_MilkButtonTypeDef *button;
    uint32_t backgroundColor;

    uint16_t textWidth;
    uint16_t textX;
    uint16_t textY;

    if (buttonIndex >= APP_MILK_BUTTON_COUNT)
    {
        return;
    }

    button = &appMilkButtons[buttonIndex];

    backgroundColor =
        (pressed != 0U) ?
        LCD_COLOR_DARKBLUE :
        LCD_COLOR_BLUE;

    BSP_LCD_SetTextColor(backgroundColor);

    BSP_LCD_FillRect(
        button->x,
        button->y,
        button->width,
        button->height
    );

    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    BSP_LCD_DrawRect(
        button->x,
        button->y,
        button->width,
        button->height
    );

    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(backgroundColor);
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);

    textWidth =
        (uint16_t)(strlen(button->label) *
                   Font16.Width);

    textX =
        button->x +
        ((button->width - textWidth) / 2U);

    textY =
        button->y +
        ((button->height - Font16.Height) / 2U);

    BSP_LCD_DisplayStringAt(
        textX,
        textY,
        (uint8_t *)button->label,
        LEFT_MODE
    );
}


static void APP_DrawAllMilkButtons(void)
{
    uint8_t i;

    for (i = 0U;
         i < APP_MILK_BUTTON_COUNT;
         i++)
    {
        APP_DrawMilkButton(i, 0U);
    }
}




static void APP_AddMilkRecord(uint16_t amountMl)
{
    RTC_TimeTypeDef rtcTime = {0};
    RTC_DateTypeDef rtcDate = {0};

    uint16_t currentYear;
    APP_MilkRecordTypeDef record;

    if (HAL_RTC_GetTime(
            &hrtc,
            &rtcTime,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    if (HAL_RTC_GetDate(
            &hrtc,
            &rtcDate,
            RTC_FORMAT_BIN) != HAL_OK)
    {
        return;
    }

    currentYear = 2000U + rtcDate.Year;

    /*
     * 检测日期是否已经改变。
     */
    if ((currentYear != appTodayYear) ||
        (rtcDate.Month != appTodayMonth) ||
        (rtcDate.Date != appTodayDay))
    {
        appTodayYear = currentYear;
        appTodayMonth = rtcDate.Month;
        appTodayDay = rtcDate.Date;

        appTodayTotalMl = 0U;
        appRecordCount = 0U;
    }

    record.year = currentYear;
    record.month = rtcDate.Month;
    record.day = rtcDate.Date;
    record.hour = rtcTime.Hours;
    record.minute = rtcTime.Minutes;
    record.second = rtcTime.Seconds;
    record.amountMl = amountMl;

    /* Only show a record after it is safely synchronized to the SD card. */
    if (APP_AppendMilkRecord(&record) != FR_OK)
    {
        return;
    }

    APP_InsertTodayRecord(&record);

    APP_DrawLeftPanel();
}

static void APP_InsertTodayRecord(const APP_MilkRecordTypeDef *record)
{
    uint8_t recordIndex;

    appTodayTotalMl += record->amountMl;

    if (appRecordCount < APP_MAX_RECORDS)
    {
        recordIndex = appRecordCount++;
    }
    else
    {
        memmove(&appMilkRecords[0], &appMilkRecords[1],
                sizeof(appMilkRecords[0]) * (APP_MAX_RECORDS - 1U));
        recordIndex = APP_MAX_RECORDS - 1U;
    }

    appMilkRecords[recordIndex] = *record;
}

static FRESULT APP_AppendMilkRecord(const APP_MilkRecordTypeDef *record)
{
    FIL file;
    FRESULT result;
    UINT bytesWritten = 0U;
    char line[48];
    int length;
    uint8_t fileOpen = 0U;

    length = snprintf(line, sizeof(line),
                      "%04u-%02u-%02u,%02u:%02u:%02u,%u\r\n",
                      record->year, record->month, record->day,
                      record->hour, record->minute, record->second,
                      record->amountMl);
    if ((length <= 0) || ((size_t)length >= sizeof(line)))
    {
        return FR_INVALID_PARAMETER;
    }

    result = f_open(&file, appSdFilePath, FA_OPEN_ALWAYS | FA_WRITE);
    if (result == FR_OK)
    {
        fileOpen = 1U;
        result = f_lseek(&file, f_size(&file));
    }
    if (result == FR_OK)
    {
        result = f_write(&file, line, (UINT)length, &bytesWritten);
        if ((result == FR_OK) && (bytesWritten != (UINT)length))
        {
            result = FR_DISK_ERR;
        }
    }
    if (result == FR_OK)
    {
        result = f_sync(&file);
    }

    if (fileOpen != 0U)
    {
        FRESULT closeResult = f_close(&file);
        if (result == FR_OK)
        {
            result = closeResult;
        }
    }
    return result;
}

static FRESULT APP_LoadTodayRecords(void)
{
    FIL file;
    FRESULT result;
    char line[64];

    result = f_open(&file, appSdFilePath, FA_READ);
    if (result != FR_OK)
    {
        return result;
    }

    while (f_gets(line, sizeof(line), &file) != NULL)
    {
        APP_MilkRecordTypeDef record;
        unsigned int year, month, day, hour, minute, second, amount;

        if (sscanf(line, "%u-%u-%u,%u:%u:%u,%u",
                   &year, &month, &day, &hour, &minute, &second,
                   &amount) != 7)
        {
            continue;
        }

        if ((year != appTodayYear) || (month != appTodayMonth) ||
            (day != appTodayDay) || (hour > 23U) || (minute > 59U) ||
            (second > 59U) || (amount > 65535U))
        {
            continue;
        }

        record.year = (uint16_t)year;
        record.month = (uint8_t)month;
        record.day = (uint8_t)day;
        record.hour = (uint8_t)hour;
        record.minute = (uint8_t)minute;
        record.second = (uint8_t)second;
        record.amountMl = (uint16_t)amount;
        APP_InsertTodayRecord(&record);
    }

