wangliwfsd/STM32_baby_feed_recorder/Core/Src/main.c
    result = f_error(&file);
    {
        FRESULT closeResult = f_close(&file);
        if (result == FR_OK)
        {
            result = closeResult;
        }
    }
    return result;
}


static void APP_ProcessTouch(void)
{
    static uint8_t previousTouching = 0U;
    static int8_t activeButtonIndex = -1;

    uint8_t touching;
    uint8_t i;

    uint16_t touchX;
    uint16_t touchY;

    uint32_t currentTick;

    if (BSP_TS_GetState(&appTouchState) != TS_OK)
    {
        return;
    }

    touching =
        (appTouchState.touchDetected > 0U) ?
        1U : 0U;

    /*
     * 刚刚按下。
     */
    if ((touching != 0U) &&
        (previousTouching == 0U))
    {
        touchX = appTouchState.touchX[0];
        touchY = appTouchState.touchY[0];

        currentTick = HAL_GetTick();

        if ((currentTick - appLastPressTick) >=
            APP_TOUCH_DEBOUNCE_MS)
        {
            for (i = 0U;
                 i < APP_MILK_BUTTON_COUNT;
                 i++)
            {
                if (APP_PointInRect(
                        touchX,
                        touchY,
                        appMilkButtons[i].x,
                        appMilkButtons[i].y,
                        appMilkButtons[i].width,
                        appMilkButtons[i].height) != 0U)
                {
                    appLastPressTick = currentTick;
                    activeButtonIndex = (int8_t)i;

                    APP_DrawMilkButton(i, 1U);

                    APP_AddMilkRecord(
                        appMilkButtons[i].amountMl
                    );

                    break;
                }
            }
        }
    }

    /*
     * 手指松开。
     */
    if ((touching == 0U) &&
        (previousTouching != 0U))
    {
        if (activeButtonIndex >= 0)
        {
            APP_DrawMilkButton(
                (uint8_t)activeButtonIndex,
                0U
            );

            activeButtonIndex = -1;
        }
    }

    previousTouching = touching;
}

static FRESULT APP_SD_Test(void)
{
    FRESULT result = FR_OK;
    FRESULT closeResult = FR_OK;
    UINT bytesWritten = 0U;

    static const char csvHeader[] =
        "date,time,amount_ml\r\n";

    appBspSdInitResult = 0xFFU;
    appBspSdCardState = 0xFFU;
    appSdDiskStatus = STA_NOINIT;
    appSdHalError = 0U;
    appSdHalState = 0U;
    appSdPhysicalDrive = 0xFFU;
    appSdFailStage = 0U;

    /*
     * SDPath 应为 "0:/"。
     */
    if ((SDPath[0] < '0') ||
        (SDPath[0] > '9'))
    {
        return FR_INVALID_DRIVE;
    }

    appSdPhysicalDrive =
        (BYTE)(SDPath[0] - '0');

    /*
     * 此处由 sd_diskio.c 内部调用 BSP_SD_Init()。
     */
    appSdDiskStatus =
        disk_initialize(appSdPhysicalDrive);

    osDelay(50U);

    appBspSdCardState =
        BSP_SD_GetCardState();

    appSdHalError =
        HAL_SD_GetError(&hsd1);

    appSdHalState =
        (uint32_t)HAL_SD_GetState(&hsd1);

    /*
     * BSP 显示值根据磁盘初始化结果记录。
     */
    if ((appSdDiskStatus & STA_NOINIT) != 0U)
    {
        appBspSdInitResult = MSD_ERROR;
        appSdFailStage = 1U;
        APP_SD_CaptureHalState();
        return FR_NOT_READY;
    }

    appBspSdInitResult = MSD_OK;

    /*
     * 挂载文件系统。
     */
    appSdFailStage = 2U;
    result = f_mount(
        &SDFatFS,
        (TCHAR const *)SDPath,
        1U
    );

    if (result != FR_OK)
    {
        APP_SD_CaptureHalState();
        return result;
    }

    snprintf(
        appSdFilePath,
        sizeof(appSdFilePath),
        "%sMILKLOG.CSV",
        SDPath
    );

    appSdFailStage = 3U;
    result = f_open(
        &appSdFile,
        appSdFilePath,
        FA_OPEN_ALWAYS | FA_WRITE
    );

    if (result != FR_OK)
    {
        APP_SD_CaptureHalState();
        (void)f_mount(
            NULL,
            (TCHAR const *)SDPath,
            1U
        );

        return result;
    }

    if (f_size(&appSdFile) == 0U)
    {
        appSdFailStage = 4U;
        result = f_write(
            &appSdFile,
            csvHeader,
            sizeof(csvHeader) - 1U,
            &bytesWritten
        );

        if ((result == FR_OK) &&
            (bytesWritten !=
             (sizeof(csvHeader) - 1U)))
        {
            result = FR_DISK_ERR;
        }

        if (result == FR_OK)
        {
            appSdFailStage = 5U;
            result = f_sync(&appSdFile);
        }

        if (result != FR_OK)
        {
            APP_SD_CaptureHalState();
        }
    }

    if (result == FR_OK)
    {
        appSdFailStage = 6U;
    }
    closeResult =
        f_close(&appSdFile);

    if (result == FR_OK)
    {
        result = closeResult;
    }

    APP_SD_CaptureHalState();
    if (result == FR_OK)
    {
        appSdFailStage = 0U;
    }
    return result;
}

static void APP_SD_CaptureHalState(void)
{
    appBspSdCardState = BSP_SD_GetCardState();
    appSdHalError = HAL_SD_GetError(&hsd1);
    appSdHalState = (uint32_t)HAL_SD_GetState(&hsd1);
}

static void APP_ShowSdTestResult(FRESULT result)
{
    char text[48];

    BSP_LCD_Clear(LCD_COLOR_WHITE);

    /*
     * 标题。
     */
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);

    if (result == FR_OK)
    {
        BSP_LCD_SetTextColor(LCD_COLOR_GREEN);

        BSP_LCD_DisplayStringAt(
            0U,
            45U,
            (uint8_t *)"SD CARD OK",
            CENTER_MODE
        );
    }
    else
    {
        BSP_LCD_SetTextColor(LCD_COLOR_RED);

        BSP_LCD_DisplayStringAt(
            0U,
            45U,
            (uint8_t *)"SD CARD ERROR",
            CENTER_MODE
        );
    }

    /*
     * 诊断信息。
     */
    BSP_LCD_SetFont(&Font16);
    BSP_LCD_SetBackColor(LCD_COLOR_WHITE);
    BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

    /*
     * FatFs 和 BSP 初始化结果。
     */
    snprintf(
        text,
        sizeof(text),
        "FatFs: %u  BSP: %u",
        (unsigned int)result,
        (unsigned int)appBspSdInitResult
    );

